app/Repositories/UserRepository.php

    private function getRolesByUserId($user_id)
    {
        $query = $this->builder->select('role.*')
            ->join('user_role', 'user_role.user_id = user.id')
            ->join('role', 'role.id = user_role.role_id')
            ->where('user.id', $user_id)
            ->distinct()
            ->get();
        return $this->getResultAs($query, self::RESULT_AS_OBJECT);
---
SELECT *
FROM `user`
WHERE `id` = 1